Revit 2027 API
UnitTypeId.Joules Property
 Joules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Joules { get; }
Public Shared ReadOnly Property Joules As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Joules {
	ForgeTypeId^ get ();
}
static member Joules : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace